Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/TBM_ДействияБотовTelegram/TBM_ДействияБотовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TBM_ДействияБотовTelegram</name>
  <attributes>
    <name>ТипДействия</name>
    <type>
      <types>EnumRef.TBM_ТипыДействийБотовTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отчеты</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.TBM_ДействияБотовTelegram</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Enums/TBM_ТипыДействийБотовTelegram/TBM_ТипыДействийБотовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TBM_ТипыДействийБотовTelegram</name>
  <enumValues>
    <name>ОтправкаОтчета</name>
  </enumValues>
  <enumValues>
    <name>МногоэтапноеДействие</name>
  </enumValues>
  <enumValues>
    <name>Этап</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольноеДействие</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/TBM_ДействияБотовTelegram/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
	 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоТипуДействия();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДействияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоТипуДействия();
	
КонецПроцедуры  

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура УстановитьВидимостьЭлементовПоТипуДействия()

	Элементы.Страницы.Видимость = ЗначениеЗаполнено(Объект.ТипДействия);
	
	Если Не Элементы.Страницы.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.ОтправкаОтчета Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтчеты;     
	ИначеЕсли Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.МногоэтапноеДействие Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМногоэтапноеДействие;
	ИначеЕсли Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.Этап Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЭтап;
	ИначеЕсли Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.ПроизвольноеДействие Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйКод; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
